package leetcode

import (
	"testing"
)

/**
给你两个按 非递减顺序 排列的整数数组 nums1 和 nums2，另有两个整数 m 和 n ，分别表示 nums1 和 nums2 中的元素数目。

 请你 合并 nums2 到 nums1 中，使合并后的数组同样按 非递减顺序 排列。

 注意：最终，合并后数组不应由函数返回，而是存储在数组 nums1 中。为了应对这种情况，nums1 的初始长度为 m + n，其中前 m 个元素表示应合并的元
素，后 n 个元素为 0 ，应忽略。nums2 的长度为 n 。



 示例 1：


输入：nums1 = [1,2,3,0,0,0], m = 3, nums2 = [2,5,6], n = 3
输出：[1,2,2,3,5,6]
解释：需要合并 [1,2,3] 和 [2,5,6] 。
合并结果是 [1,2,2,3,5,6] ，其中斜体加粗标注的为 nums1 中的元素。


 示例 2：


输入：nums1 = [1], m = 1, nums2 = [], n = 0
输出：[1]
解释：需要合并 [1] 和 [] 。
合并结果是 [1] 。


 示例 3：


输入：nums1 = [0], m = 0, nums2 = [1], n = 1
输出：[1]
解释：需要合并的数组是 [] 和 [1] 。
合并结果是 [1] 。
注意，因为 m = 0 ，所以 nums1 中没有元素。nums1 中仅存的 0 仅仅是为了确保合并结果可以顺利存放到 nums1 中。




 提示：


 nums1.length == m + n
 nums2.length == n
 0 <= m, n <= 200
 1 <= m + n <= 200
 -10⁹ <= nums1[i], nums2[j] <= 10⁹




 进阶：你可以设计实现一个时间复杂度为 O(m + n) 的算法解决此问题吗？

 Related Topics 数组 双指针 排序 👍 2461 👎 0

*/

// leetcode submit region begin(Prohibit modification and deletion)
// 对于单链表来说，我们直接用双指针从头开始合并即可，但对于数组来说会出问题。
// 因为题目让我直接把结果存到 nums1 中，而 nums1 的开头有元素，
// 如果我们无脑复制单链表的逻辑，会覆盖掉 nums1 的原始元素，导致错误。
//
// 但 nums1 后面是空的呀，所以这道题需要我们稍微变通一下：
// 将双指针初始化在数组的尾部，然后从后向前进行合并，
// 这样即便覆盖了 nums1 中的元素，这些元素也必然早就被用过了，不会影响答案的正确性。
func merge(nums1 []int, m int, nums2 []int, n int) {
	// 初始化指针
	i, j, p := m-1, n-1, len(nums1)-1
	// 两个数组都未遍历完时进行比较
	for i >= 0 && j >= 0 {
		// 挑选大的元素放入 nums1 的末位
		if nums1[i] > nums2[j] {
			nums1[p] = nums1[i]
			i--
		} else {
			nums1[p] = nums2[j]
			j--
		}
		p-- // 从后往前生成结果
	}
	for j >= 0 { // nums2 剩余元素放入 nums1
		nums1[p] = nums2[j]
		j--
		p--
	}
}

//leetcode submit region end(Prohibit modification and deletion)

func TestMergeSortedArray(t *testing.T) {

}
